Tekla Open API Reference for Tekla Structures 2025
NumberingSeriesNullable.Prefix Property
 Gets or sets the numbering prefix.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Prefix { get; set; }
Public Property Prefix As String
	Get
	Set
Property Value
Type: String
See Also
Reference
NumberingSeriesNullable Class
Tekla.Structures.Model Namespace